spec/fixtures/vcr_cassettes/iss_net_1_0_recepcionar_lote_rps.yml

---
http_interactions:
- request:
    method: post
    uri: http://www.issnetonline.com.br/webserviceabrasf/homologacao/servicos.asmx
    body:
      encoding: UTF-8
      string: |-
        <?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://www.issnetonline.com.br/webservice/nfd" xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Body><RecepcionarLoteRps><xml><![CDATA[<?xml version="1.0" encoding="utf-8"?>
        <EnviarLoteRpsEnvio xmlns="http://www.issnetonline.com.br/webserviceabrasf/vsd/servico_enviar_lote_rps_envio.xsd" xmlns:tc="http://www.issnetonline.com.br/webserviceabrasf/vsd/tipos_complexos.xsd">
          <LoteRps>
            <tc:NumeroLote>1</tc:NumeroLote>
            <tc:CpfCnpj>
              <tc:Cnpj>14576582000163</tc:Cnpj>
            </tc:CpfCnpj>
            <tc:InscricaoMunicipal>124762</tc:InscricaoMunicipal>
            <tc:QuantidadeRps>1</tc:QuantidadeRps>
            <tc:ListaRps>
              <tc:Rps>
                <tc:InfRps>
                  <tc:IdentificacaoRps>
                    <tc:Numero>15</tc:Numero>
                    <tc:Serie>8</tc:Serie>
                    <tc:Tipo>1</tc:Tipo>
                  </tc:IdentificacaoRps>
                  <tc:DataEmissao>2014-06-24T10:00:00</tc:DataEmissao>
                  <tc:NaturezaOperacao>1</tc:NaturezaOperacao>
                  <tc:OptanteSimplesNacional>2</tc:OptanteSimplesNacional>
                  <tc:IncentivadorCultural>2</tc:IncentivadorCultural>
                  <tc:Status>1</tc:Status>
                  <tc:RegimeEspecialTributacao>1</tc:RegimeEspecialTributacao>
                  <tc:Servico>
                    <tc:Valores>
                      <tc:ValorServicos>35</tc:ValorServicos>
                      <tc:ValorPis>0</tc:ValorPis>
                      <tc:ValorCofins>0</tc:ValorCofins>
                      <tc:ValorInss>0</tc:ValorInss>
                      <tc:ValorIr>0</tc:ValorIr>
                      <tc:ValorCsll>0</tc:ValorCsll>
                      <tc:IssRetido>2</tc:IssRetido>
                      <tc:ValorIss>0</tc:ValorIss>
                      <tc:BaseCalculo>35</tc:BaseCalculo>
                      <tc:Aliquota>5.00</tc:Aliquota>
                      <tc:ValorLiquidoNfse>35</tc:ValorLiquidoNfse>
                      <tc:DescontoIncondicionado>0</tc:DescontoIncondicionado>
                      <tc:DescontoCondicionado>0</tc:DescontoCondicionado>
                    </tc:Valores>
                    <tc:ItemListaServico>8</tc:ItemListaServico>
                    <tc:CodigoCnae>6399200</tc:CodigoCnae>
                    <tc:Discriminacao>Discriminação da RPS</tc:Discriminacao>
                    <tc:CodigoTributacaoMunicipio>50000024</tc:CodigoTributacaoMunicipio>
                    <tc:MunicipioPrestacaoServico>999</tc:MunicipioPrestacaoServico>
                  </tc:Servico>
                  <tc:Prestador>
                    <tc:CpfCnpj>
                      <tc:Cnpj>14576582000163</tc:Cnpj>
                    </tc:CpfCnpj>
                    <tc:InscricaoMunicipal>124762</tc:InscricaoMunicipal>
                  </tc:Prestador>
                  <tc:Tomador>
                    <tc:IdentificacaoTomador>
                      <tc:CpfCnpj>
                        <tc:Cpf>93565968834</tc:Cpf>
                      </tc:CpfCnpj>
                    </tc:IdentificacaoTomador>
                    <tc:RazaoSocial>José Serra</tc:RazaoSocial>
                    <tc:Endereco>
                      <tc:Endereco>R dos Navegantes 123, 321</tc:Endereco>
                      <tc:Numero>123</tc:Numero>
                      <tc:Complemento>321</tc:Complemento>
                      <tc:Bairro>Boa Viagem</tc:Bairro>
                      <tc:Cidade>1</tc:Cidade>
                      <tc:Estado>PE</tc:Estado>
                      <tc:Cep>51021010</tc:Cep>
                    </tc:Endereco>
                  </tc:Tomador>
                </tc:InfRps>
              </tc:Rps>
            </tc:ListaRps>
          </LoteRps>
          <Signature xmlns="http://www.w3.org/2000/09/xmldsig#">
        <SignedInfo>
        <CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
        <SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
        <Reference>
        <Transforms>
        <Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
        </Transforms>
        <DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
        <DigestValue>8AXJf2h4iLh6Q5wv9ELO2WRmH9s=</DigestValue>
        </Reference>
        </SignedInfo>
        <SignatureValue>kQXJoLSYxFZriX113XrVKICb1DTI3rHHgtXEUKab08Nc3DMNyyUu07YYlpEVvXEE
        mkCxDNXOLzDCRLC7+jaKwEIAlOX3G8ikD9GQFqX+j7AT3J99zMULmst8g09ERGJB
        FFmM7SH/R1rdgfavUyWWRQjjOXe9t7z3hyUF+V0CJR2zO/q/gJqz2K4ZBRvf5am6
        P7/sSNsq6y/u7d34iZlcEK16KVtNz+eLa5hvJKQaQMyF3ri5H79sVpaWEIbBSbST
        q2GyP2neYzU4CFfcuTBO7OBWa0B54+BjAERslQRqaG9btc+7KXkQaVA6bJJstIZx
        L/dlRyxXXJKSCQbcIlmUyA==</SignatureValue>
        <KeyInfo>
        <X509Data>
        <X509Certificate>MIIH7jCCBdagAwIBAgIIebwmN9dD4mUwDQYJKoZIhvcNAQELBQAwTDELMAkGA1UE
        BhMCQlIxEzARBgNVBAoTCklDUC1CcmFzaWwxKDAmBgNVBAMTH1NFUkFTQSBDZXJ0
        aWZpY2Fkb3JhIERpZ2l0YWwgdjIwHhcNMTQwMzE5MTc0MjAwWhcNMTUwMzE5MTc0
        MjAwWjCCAQoxCzAJBgNVBAYTAkJSMRMwEQYDVQQKEwpJQ1AtQnJhc2lsMRQwEgYD
        VQQLEwsoRU0gQlJBTkNPKTEYMBYGA1UECxMPMDAwMDAxMDA0OTk4NDUzMRQwEgYD
        VQQLEwsoRU0gQlJBTkNPKTEUMBIGA1UECxMLKEVNIEJSQU5DTykxFDASBgNVBAsT
        CyhFTSBCUkFOQ08pMRQwEgYDVQQLEwsoRU0gQlJBTkNPKTEUMBIGA1UECxMLKEVN
        IEJSQU5DTykxSDBGBgNVBAMTP0lOU1RJVFVUTyBERSBTRVJWSUNPUyBFRFVDQUNJ
        T05BSVMgRSBGT1JNQVRJVk9TIFBBRFJFIFBJTyBMVERBLjCCASIwDQYJKoZIhvcN
        AQEBBQADggEPADCCAQoCggEBAKoxgxMqQ82YFU2g8qGqTkX1ImB/kvunqrNyNqF0
        FIJ6T2Knzl+30aFvUkGwCzDZQsZrZvKUEX2zZ4avJFOTwXJpf3O1wARR972Dob75
        W8O39XuyMCXVoTdnmc9I0veiaCy1T6qfRWHGjgdDYCwp6D0FL1inkOaCGc21NpQb
        /d4VDto3MELOjvsyT6WOPjn3sRjQB87tZGwxFq/mas3aq3qqMeLBsNtW6ff7EHqA
        94PrJj/Hk8bVxx8c/fc3kyKPBgrY426rEnUOZeSHnLj97AEoVSapFQpdEFU8jtxL
        NZnFgKwPvOm5zFOzKi3uyFqvkuxR8f1AMEjB31fwbfn9WJcCAwEAAaOCAxIwggMO
        MIGXBggrBgEFBQcBAQSBijCBhzBHBggrBgEFBQcwAoY7aHR0cDovL3d3dy5jZXJ0
        aWZpY2Fkb2RpZ2l0YWwuY29tLmJyL2NhZGVpYXMvc2VyYXNhY2R2Mi5wN2IwPAYI
        KwYBBQUHMAGGMGh0dHA6Ly9vY3NwLmNlcnRpZmljYWRvZGlnaXRhbC5jb20uYnIv
        c2VyYXNhY2R2MjAfBgNVHSMEGDAWgBSa4IMQ1yab6bragrKBzjka04dwhjBxBgNV
        HSAEajBoMGYGBmBMAQIBBjBcMFoGCCsGAQUFBwIBFk5odHRwOi8vcHVibGljYWNh
        by5jZXJ0aWZpY2Fkb2RpZ2l0YWwuY29tLmJyL3JlcG9zaXRvcmlvL2RwYy9kZWNs
        YXJhY2FvLXNjZC5wZGYwgfAGA1UdHwSB6DCB5TBJoEegRYZDaHR0cDovL3d3dy5j
        ZXJ0aWZpY2Fkb2RpZ2l0YWwuY29tLmJyL3JlcG9zaXRvcmlvL2xjci9zZXJhc2Fj
        ZHYyLmNybDBDoEGgP4Y9aHR0cDovL2xjci5jZXJ0aWZpY2Fkb3MuY29tLmJyL3Jl
        cG9zaXRvcmlvL2xjci9zZXJhc2FjZHYyLmNybDBToFGgT4ZNaHR0cDovL3JlcG9z
        aXRvcmlvLmljcGJyYXNpbC5nb3YuYnIvbGNyL1NlcmFzYS9yZXBvc2l0b3Jpby9s
        Y3Ivc2VyYXNhY2R2Mi5jcmwwDgYDVR0PAQH/BAQDAgXgMB0GA1UdJQQWMBQGCCsG
        AQUFBwMCBggrBgEFBQcDBDCBuwYDVR0RBIGzMIGwgRhGQUJJQU5PSElHVUNISUBH
        TUFJTC5DT02gPgYFYEwBAwSgNRMzMTIxMjE5NzgzMDE0NjM3NDgzNTAwMDAwMDAw
        MDAwMDAwMDAwMjk4MjAwOTk1U1NQIFNQoCAGBWBMAQMCoBcTFUZBQklBTk8gUEFV
        TE8gSElHVUNISaAZBgVgTAEDA6AQEw4xNDU3NjU4MjAwMDE2M6AXBgVgTAEDB6AO
        EwwwMDAwMDAwMDAwMDAwDQYJKoZIhvcNAQELBQADggIBAJ/L2TL9T4d3b8v6gKSH
        4CQjNIcEdlbxNWnxxjDhpPFOVaCswLU7rDeRsqaqv/iu6vFXJwhSHrAtvtOw0Pm+
        B8/rAEagE9GCV4LBobGKQLfuzWk75ppULFHEVHT4HuW9zkxAUU42M7qTxZN3vi9X
        048TqAukgGtBFqMyDIvNAJJYZsHzIn8SS1IYWVP/+dgCzYC0l54U+HcK9N8KEypU
        v0BZ+ZQkjjuU7KTOpDn7OwE2L009KKh/WETjElTIDa7EjUeguLgBnbPUImGU9SNc
        a7SIxXssFQQV78tWgfJYovmzTMCrd9WDezRNtvYY5Nk++9A/m0ro2efahd9uZJoO
        IihIXSanv5ChGITRUW5ADckfmMOkhmZAXpizDsjhl1DjeVPQ33imHe7PsX6cvP1Q
        C28YHJ7OwCr3MTjFybxCe8w9Wtw5pobu4S9sC6H4yZQIIWywZWS9z8dMGfreTGtS
        jsr2ACd5QFUk7a8bCXHF0hKmpcXhIQrCCJimwXHLarRJgjcFXm/SgIlxvAlzm1N7
        MVtDqPwyb4gtLpbxUnHFVqC3Gd8M1QD4gTnjIELR/cIF6VelzISDE1mpiKNAK5Uq
        wDQ51Yr8gzAVv6YJzf3eeMY+UaalrhF0TjteWzEdsn4dp9nX3K2qzx3BlQ4fQfbJ
        AZNA4jQj/HCGCNKespYVBi6x</X509Certificate>
        </X509Data>
        </KeyInfo>
        </Signature>
        </EnviarLoteRpsEnvio>
        ]]></xml></RecepcionarLoteRps></soap:Body></soap:Envelope>
    headers:
      Soapaction:
      - '"RecepcionarLoteRps"'
      Content-Type:
      - application/soap+xml;charset=UTF-8
      Content-Length:
      - '7185'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Fri, 11 Jul 2014 08:56:56 GMT
      Server:
      - Microsoft-IIS/6.0
      X-Powered-By:
      - ASP.NET
      X-Aspnet-Version:
      - 2.0.50727
      Cache-Control:
      - private, max-age=0
      Content-Type:
      - application/soap+xml; charset=utf-8
      Content-Length:
      - '799'
    body:
      encoding: UTF-8
      string: "<?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:soap=\"http://www.w3.org/2003/05/soap-envelope\"
        xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"><soap:Body><RecepcionarLoteRpsResponse
        xmlns=\"http://www.issnetonline.com.br/webservice/nfd\"><RecepcionarLoteRpsResult>&lt;?xml
        version=\"1.0\" encoding=\"utf-8\"?&gt;\r\n&lt;EnviarLoteRpsResposta xmlns=\"http://www.issnetonline.com.br/webserviceabrasf/vsd/servico_enviar_lote_rps_resposta.xsd\"&gt;\r\n
        \ &lt;NumeroLote&gt;1&lt;/NumeroLote&gt;\r\n  &lt;DataRecebimento&gt;2014-07-11T05:56:56&lt;/DataRecebimento&gt;\r\n
        \ &lt;Protocolo&gt;db1c3e91-6aea-4450-a3fc-5b6a7fba7dc7&lt;/Protocolo&gt;\r\n&lt;/EnviarLoteRpsResposta&gt;</RecepcionarLoteRpsResult></RecepcionarLoteRpsResponse></soap:Body></soap:Envelope>"
    http_version: 
  recorded_at: Fri, 11 Jul 2014 08:56:58 GMT
recorded_with: VCR 2.9.2
